Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The extension has support for all basic debugging features as well as some more advanced features, such as breakpoint directives (as comments) and conditional breakpoints.
ja: この拡張機能は、すべての基本的なデバッグ機能に加え、ブレークポイントディレクティブ（コメントとして）や条件付きブレークポイントなど、より高度な機能をサポートしています。

source: The fat arrow syntax can also be used outside of expressions as shorthand for a normal function or method definition.
ja: ファットアロー構文は、通常の関数やメソッド定義の略記として、式の外でも使用できます。

source: The fat arrow syntax can also be used to define methods and property getters/setters (in which case the method/property definition itself isn't an expression, but its body just returns an expression).
ja: ファットアロー構文は、メソッドやプロパティのゲッター/セッターの定義にも使用できます（この場合、メソッド/プロパティの定義自体は式ではなく、その本体が式を返すだけです）。

source: The file AutoHotkey.exe is all that is needed to launch any .ahk script.
ja: AutoHotkey.exeファイルは、すべての.ahkスクリプトを起動するために必要なすべてのものです。

source: The file does not have to exist at the time the shortcut is created; however, if it does not, some systems might alter the path in unexpected ways.
ja: ショートカットの作成時にファイルが存在する必要はありませんが、存在しない場合、システムによっては予期せぬ方法でパスが変更される可能性があります。

source: The file handle is not closed automatically when the file object is destroyed and calling Close has no effect.
ja: ファイルオブジェクトが破棄されても、ファイルハンドルは自動的にクローズされず、Closeを呼び出しても何の効果もない。

source: The file handle is not closed automatically when the file object is destroyed and calling File.Close has no effect.
ja: ファイルオブジェクトが破棄されても、ファイルハンドルは自動的にクローズされず、File.Closeを呼び出しても何の効果もない。

source: The file is assumed to be in (or relative to) the compiler's own directory if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合、ファイルはコンパイラー自身のディレクトリにある（または相対的な）ものとみなされる。

source: The file is assumed to be in (or relative to) the script's own directory if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合、ファイルはスクリプト自身のディレクトリにある（または相対的な）ものとみなされます。

source: The file is kept open for the entire operation to avoid having to re-scan each time to find the next line.
ja: 次の行を探すために毎回再スキャンする必要がないように、操作中はファイルを開いたままにしておきます。

source: The file is not opened if nothing is ever written to it.
ja: 何も書き込まれない場合は、ファイルは開かれません。

source: The file is on a removable drive.
ja: リムーバブルドライブ上にあるファイルです。

source: The file may be permanently deleted without warning if the file cannot be recycled for other reasons, such as:
ja: など、他の理由でファイルをリサイクルできない場合、警告なしにファイルを永久に削除することがあります：

source: The file name of an image, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 画像のファイル名。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The file name or URL to be analyzed.
ja: 解析対象のファイル名またはURL。

source: The file object provides an interface for a file to perform actions, such as reading or writing data, or to retrieve or set values, such as length.
ja: ファイルオブジェクトは、データの読み出しや書き込みなどの動作や、長さなどの値の取得や設定を行うためのインターフェイスを提供します。

source: The file path may optionally be preceded by *i and a single space, which causes the program to ignore any failure to load the file.
ja: ファイルパスの前に *iと1 つのスペースを付けると、プログラムはファイルの読み込みに失敗しても無視します。

source: The file path may optionally be preceded by *i and a single space, which causes the program to ignore any failure to read the file.
ja: ファイルパスの前に*iと空白1個を付けることもできますが、この場合、プログラムはこのファイルの読み込みに失敗しても無視します。

source: The file's extension (e.g. TXT, DOC, or EXE).
ja: ファイルの拡張子（例：TXT、DOC、EXE）。

source: The file's extension is included.
ja: ファイルの拡張子も含まれる。

source: The file's lines may end in carriage return and linefeed (`r`n), just linefeed (`n), or just carriage return (`r).
ja: ファイルの行末は、キャリッジリターンとラインフィード（`r`n）、ラインフィード（`n）だけ、またはキャリッジリターン（`r）だけであることができます。

source: The filename of the picture, which is usually assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 画像のファイル名。絶対パスが指定されていない場合、通常はA_WorkingDirにあると仮定されます。

source: The filename of the resource to add.
ja: 追加するリソースのファイル名。

source: The final backslash is not included even if the file is located in a drive's root directory.
ja: ファイルがドライブのルート・ディレクトリにある場合でも、最後のバックスラッシュは含まれない。

source: The final backslash is not included unless it is the root directory.
ja: ルート・ディレクトリでない限り、最後のバックスラッシュは含まれない。

source: The final backslash is omitted (even for root directories).
ja: 最後のバックスラッシュは（ルート・ディレクトリでも）省略される。

source: The fire-on-release effect is disabled if the tilde prefix is applied to the prefix key in at least one active custom combination or the suffix hotkey itself.
ja: 少なくとも1つのアクティブなカスタムコンビネーションまたはサフィックスホットキー自体のプレフィックスキーにチルダプレフィックスが適用されている場合、ファイアオンリリース効果は無効となります。

source: The first Return ensures that the subsequent function call is skipped if the preceding condition is true.
ja: 最初のReturnは、直前の条件が真であれば、後続の関数呼び出しがスキップされることを保証します。

source: The first column is 1 (not 0).
ja: 1列目は1（0ではない）です。

source: The first column is 1.
ja: 最初の列は1です。

source: The first column is number 1 (not 0).
ja: 1列目は1番（0番ではない）です。

source: The first entry in the control is 1, the second 2, and so on.
ja: コントロールの最初のエントリーは1、2番目のエントリーは2、・・・となります。

source: The first entry or tab is 1, the second is 2, etc.
ja: 最初のエントリやタブは1、2番目は2、といった具合です。

source: The first four symbols correspond to the standard modifier keys, Ctrl (^), Alt (!), Shift (+) and Win (#).
ja: 最初の4つの記号は、標準的な修飾キーであるCtrl（^）、Alt（!）、Shift（+）、Win（#）に対応しています。

source: The first hotkey in this example toggles the suspension.
ja: この例では、最初のホットキーでサスペンションを切り替えています。

source: The first item.
ja: 最初の項目。

source: The first line is 1.
ja: 1行目は1です。

source: The first member is always at offset 0.
ja: 最初のメンバーは常にオフセット0にあります。

source: The first parameter affects only the behavior of the current thread as follows:
ja: 最初のパラメータは、次のように現在のスレッドの動作にのみ影響します：

source: The first parameter is displayed as the message.
ja: 最初のパラメーターがメッセージとして表示される。

source: The first statement of each case may be below Case or on the same line, following the colon.
ja: 各ケースの最初の文は、Caseの下か、コロンに続く同じ行に書くことができる。

source: The first surplus parameter is at params[1], the second at params[2] and so on.
ja: 最初の余剰パラメータはparams[1]に、2番目のパラメータはparams[2]に、といった具合に。

source: The first value has an index of 1.
ja: 最初の値はインデックスが1です。

source: The first version string to be compared.
ja: 比較される最初のバージョン文字列。

source: The flag is set automatically when a BSTR is allocated as a result of type conversion performed by ComValue, such as ComValue(8, "example").
ja: ComValue(8, "example")のようにComValueで型変換を行った結果、BSTRが確保された場合に自動的に設定されるフラグです。

source: The focused item changes in a ListView.
ja: ListViewでフォーカスされた項目が変化します。

source: The focused item changes.
ja: フォーカスされる項目が変わります。

source: The following parsing loop will work correctly regardless of whether each line ends in `r`n or just `n:
ja: 以下の解析ループは、各行の末尾が `r`n であろうと `n だけであろうと、正しく動作します：

source: The following parsing loop will work correctly regardless of whether each line ends in `r`n or just `n: Loop Parse, MyFileContents, "`n", "`r".
ja: 以下の解析ループは、各行の末尾が `r`n であろうと `n だけであろうと、正しく動作します：Loop Parse, MyFileContents, "`n", "`r"。

source: The following DllCall topics are also applicable to ComCall:
ja: 以下のDllCallのトピックは、ComCallにも適用されます：

source: The following POSIX named sets are also supported via the form [[:xxx:]], where xxx is one of the following words:
ja: 以下のPOSIX名前付き集合も、[[:xxx:]]形式でサポートされている：

source: The following actions may be taken automatically, without warning:
ja: 以下のアクションは、警告なしに自動的に実行されることがあります：

source: The following applies to all three operators:
ja: 以下は、3つの演算子すべてに適用されます：

source: The following approximate POV values are used by many joysticks:
ja: 多くのジョイスティックでは、以下のようなPOV値の目安が使われています：

source: The following blog article by Louis Kessler describes the problem well:
ja: Louis Kesslerによる次のブログ記事は、この問題をよく表しています。

source: The following blog article by Louis Kessler describes the problem well: That’s not very Smart of you, Microsoft
ja: Louis Kesslerによる次のブログ記事は、この問題をよく表しています：That’s not very Smart of you, Microsoft

source: The following built-in variables can be assigned values:
ja: 以下の組み込み変数に値を割り当てることができます：

source: The following classes relate to primitive values:
ja: 以下のクラスは、プリミティブ値に関するものです：

source: The following code illustrates how the default title could be determined by the script itself (but the actual title can be retrieved with WinGetTitle):
ja: 次のコードは、デフォルトのタイトルをスクリプト自身で決定する方法を示している（ただし、実際のタイトルはWinGetTitleで取得できる）：

source: The following code is roughly equivalent to this function:
ja: 次のコードは、この機能とほぼ同等です：

source: The following commands now set A_LastError to assist with debugging:
ja: 以下のコマンドでは、デバッグを支援するためにA_LastErrorを設定するようにしました：

source: The following commands now set A_LastError to assist with debugging: FileAppend, FileRead, FileReadLine, FileDelete, FileCopy, FileMove, FileGetAttrib/Time/Size/Version, FileSetAttrib/Time, FileCreateDir, RegRead, RegWrite, RegDelete.
ja: 以下のコマンドでは、デバッグを支援するためにA_LastErrorを設定するようにしました：FileAppend、FileRead、FileReadLine、FileDelete、FileCopy、FileMove、FileGetAttrib/Time/Size/Version、FileSetAttrib/Time、FileCreateDir、RegRead、RegWrite、RegDelete。

source: The following control events were removed, but detecting them is a simple case of passing the appropriate numeric notification code (defined in the Windows SDK) to GuiControl.OnNotify(): K, D, d, A, S, s, M, C, E and MonthCal's 1 and 2.
ja: 以下の制御イベントは削除されましたが、これらを検出するには、GuiControl.OnNotify()に適切な数値通知コード（Windows SDKで定義）を渡すだけで、簡単に検出できます：K、D、d、A、S、s、M、C、E、および、MonthCalの1、2です。

source: The following control events were removed, but detecting them is a simple case of passing the appropriate numeric notification code (defined in the Windows SDK) to GuiCtrl.OnNotify():
ja: 以下の制御イベントは削除されましたが、これらを検出するには、GuiCtrl.OnNotify()に適切な数値通知コード（Windows SDKで定義）を渡すだけで、簡単に検出できます：

source: The following control flow statements exist:
ja: 以下のような制御フロー文が存在：

source: The following custom functions can be used to run a command and retrieve its output or to run multiple commands in one go and retrieve their output.
ja: 以下のカスタム関数を使用して、コマンドを実行してその出力を取得したり、複数のコマンドを一度に実行してその出力を取得したりすることができます。

source: The following describes each option:
ja: 以下、各オプションについて説明します：

source: The following does the same as above, plus the subject and body.
ja: 以下は、上記と同じに、件名と本文を追加します。

source: The following events are supported by Gui objects:
ja: Guiオブジェクトがサポートしているイベントは次のとおりです：

source: The following events are supported by GuiControl objects, depending on the control type:
ja: GuiControlオブジェクトは、コントロールの種類に応じて、以下のイベントをサポートしています：

source: The following events can be detected by calling OnEvent to register a callback function or method:
ja: OnEventを呼び出してコールバック関数やメソッドを登録することで、以下のイベントを検出することができます：

source: The following example remaps the left Win to become the left Ctrl:
ja: 次の例では、左Winを左Ctrlに再マッピングしています：

source: The following example achieves this by sending spacebar keystrokes repeatedly while you hold down the controller's second button:
ja: 以下の例では、コントローラーの第2ボタンを押しながらスペースバーのキー入力を繰り返すことでこれを実現しています：

source: The following example activates a Notepad window by its process name:
ja: 次の例は、プロセス名でメモ帳ウィンドウをアクティブにする：

source: The following example activates a console window (e.g. cmd.exe):
ja: 次の例は、コンソール・ウィンドウ（cmd.exeなど）をアクティブにします：

source: The following example activates a window by a process ID stored in VarContainingPID:
ja: 次の例は、VarContainingPIDに格納されたプロセスIDによってウィンドウをアクティブにする：

source: The following example activates and maximizes the Notepad window found by WinExist:
ja: 次の例は、WinExistによって見つかったメモ帳ウィンドウをアクティブにし、最大化します：

source: The following example activates any window matching the criteria defined by a window group:
ja: 次の例は、ウィンドウ・グループで定義された条件に一致するウィンドウをアクティブにします：

source: The following example activates the calculator found by WinExist and moves it to a new position:
ja: 次の例は、WinExistによって見つかった電卓をアクティブにし、新しい位置に移動させます：

source: The following example asks Winamp which track number is currently active:
ja: 次の例は、現在アクティブなトラック番号をWinampに尋ねます：

source: The following example builds on the previous example under Ad Hoc (combine the two before running it):
ja: 次の例は、アドホック（Ad Hoc）の前の例を基にしたものである（実行する前にこの2つを組み合わせてください）：

source: The following example causes Ctrl+CapsLock to act as a toggle for Shift:
ja: 次の例では、Ctrl+CapsLockが Shiftのトグルとして機能するようにします：

source: The following example converts a string to uppercase:
ja: 次の例は、文字列を大文字に変換するものです：

source: The following example converts a string to uppercase: DllCall("CharUpper", "Ptr", StrPtr(MyVar), "Ptr").
ja: 次の例は、文字列を大文字に変換するものです：DllCall("CharUpper", "Ptr", StrPtr(MyVar), "Ptr")。

source: The following example creates a hotkey which can be pressed to maximize the active window:
ja: 次の例では、アクティブウィンドウを最大化するために押すホットキーを作成します：

source: The following example defines a function array which can be called; when called, it calls each element of the array in turn.
ja: 呼び出されると、配列の各要素を順番に呼び出す。

source: The following example disables the ability for the left Win to activate the Start Menu, while still allowing its use as a modifier:
ja: 次の例は、左Winでスタートメニューを起動する機能を無効にし、モディファイアとして使用できるようにしたものです：

source: The following example disables the right-side Win:
ja: 次の例では、右側のWinを無効にしています：

source: The following example does the same as above, but uses a regular expression (note that the RegEx title matching mode must be turned on beforehand to make it work):
ja: 次の例は上記と同じだが、正規表現を使っている（動作させるには、RegExのタイトルマッチングモードをあらかじめオンにしておく必要があることに注意）：

source: The following example exits the script when too few parameters are passed to it:
ja: 以下の例では、渡されるパラメーターが少なすぎる場合にスクリプトを終了している：

source: The following example makes the controller's POV hat behave like the arrow key cluster on a keyboard; that is, the POV hat will send arrow keystrokes (left, right, up, and down):
ja: 次の例では、コントローラのPOVハットをキーボードの矢印キーのように動作させます； つまり、POVハットは矢印キー（左、右、上、下）を送信します：

source: The following example makes the controller's X and Y axes behave like the arrow key cluster on a keyboard (left, right, up, and down):
ja: 以下の例では、コントローラのX軸とY軸をキーボードの矢印キーのように動作させます（左、右、上、下）：

source: The following example makes the controller's second button become the left-arrow key:
ja: 次の例では、コントローラーの第2ボタンを左矢印キーにします：

source: The following example makes the controller's third button become the left mouse button:
ja: 次の例では、コントローラの第3ボタンをマウスの左ボタンにします：

source: The following example opens Notepad, waits until it exists and activates it:
ja: 次の例では、メモ帳を開き、それが存在するまで待ち、それを起動する：

source: The following example puts the C and * options (case sensitive and "ending character not required") into effect for a single hotstring:
ja: 次の例では、1つのホットストリングに対して、Cと*のオプション（大文字と小文字を区別し、「終端文字は不要」）を有効にしています。

source: The following example puts the C and * options (case-sensitive and "ending character not required") into effect for a single hotstring:
ja: 次の例では、Cと*オプション（大文字と小文字が区別され、"エンディングキャラクターは不要"）をこのホットストリングのみに対して有効にします。

source: The following example puts the C and * options (case-sensitive and "ending character not required") into effect for a single hotstring: :c*:j@::john@somedomain.com.
ja: 次の例では、Cと*オプション（大文字と小文字が区別され、「エンディングキャラクターは不要」）をこのホットストリングのみに対して有効にします：:c*:j@::john@somedomain.com。

source: The following example puts the C and R options into effect:
ja: 次の例では、CとRのオプションを有効にしています。

source: The following example puts the C and R options into effect: #Hotstring c r.
ja: 次の例では、CとRのオプションを有効にしています：#Hotstring c r。

source: The following example reports all selected rows in the ListView:
ja: 次の例では、ListViewで選択されたすべての行をレポートします：

source: The following example retrieves and reports the unique ID (HWND) of the active window:
ja: 以下の例では、アクティブウィンドウのユニークID（HWND）を取得し、報告している：

source: The following example sends 20 tab keystrokes:
ja: 次の例では、タブキーを20回送信しています：

source: The following example should open license.txt in Notepad:
ja: 以下の例では、license.txtをメモ帳で開いているはずです：

source: The following example subtracts 7 days from the specified time:
ja: 次の例は、指定した時間から7日間を差し引いたものです：

source: The following example traverse the entire tree, item by item:
ja: 次の例は、ツリー全体を項目ごとに走査するものである：

source: The following example traverses the entire tree, item by item:
ja: 次の例は、ツリー全体を項目ごとに走査するものである：

source: The following example uses ^!s to indicate Ctrl+Alt+S:
ja: 次の例では、Ctrl+Alt+Sを示すために^!sを使用しています：

source: The following examples are equivalent to those above:
ja: 以下の例は上記と同等である：

source: The following examples operate on a window by a unique ID stored in VarContainingID:
ja: 以下の例は、VarContainingIDに格納された一意のIDによってウィンドウを操作する：

source: The following folder structure is supported, where the running version of Ahk2Exe.exe is in the first \Compiler directory shown below:
ja: 以下のフォルダ構成がサポートされており、実行バージョンのAhk2Exe.exeは、以下に示す1つ目の \compilerディレクトリにあります：

source: The following formats must be used alone; that is, with no other formats or text present in the Format parameter.
ja: 以下のフォーマットは単独で使用する必要があります。つまり、Formatパラメータに他のフォーマットやテキストが存在しない状態で使用します。

source: The following function can be used for this purpose:
ja: その際、以下の機能を利用することができます：

source: The following function has its Z parameter marked optional:
ja: 次の関数は、そのZパラメータがオプションと表示されています：

source: The following functions are also useful for debugging:
ja: 以下の関数もデバッグに役立つ：

source: The following functions are also useful for debugging: ListLines, KeyHistory, and OutputDebug.
ja: 以下の関数もデバッグに役立つ：ListLines、KeyHistory、OutputDebug。

source: The following functions are always able to show the main window and select the corresponding View options when they are encountered in the script at runtime:
ja: 以下の関数は、スクリプトの実行時にメインウィンドウを表示し、対応するビューオプションを選択することができます：

source: The following functions are always able to show the main window and select the corresponding View options when they are encountered in the script at runtime: ListLines, ListVars, ListHotkeys, and KeyHistory.
ja: 以下の関数は、スクリプトの実行時にメインウィンドウを表示し、対応するビューオプションを選択することができます：ListLines、ListVars、ListHotkeys、KeyHistory。

source: The following functions may affect performance depending on the nature of the script:
ja: 以下の関数は、スクリプトの性質によってパフォーマンスに影響を与える可能性があります：

source: The following functions may affect performance depending on the nature of the script: SendMode, SetKeyDelay, SetMouseDelay, SetWinDelay, SetControlDelay, and SetDefaultMouseSpeed.
ja: 以下の関数は、スクリプトの性質によってパフォーマンスに影響を与える可能性があります：SendMode、SetKeyDelay、SetMouseDelay、SetWinDelay、SetControlDelay、SetDefaultMouseSpeed。

source: The following functions return a pure integer instead of a hexadecimal string:
ja: 以下の関数は、16進数文字列の代わりに純粋な整数を返します：

source: The following functions were formerly sub-commands of SysGet:
ja: 以下の関数は、以前はSysGetのサブコマンドでした：

source: The following is a last resort and generally should be attempted only in desperation.
ja: 以下は最終手段であり、一般的には絶望的な場合にのみ試みるべきものです。

source: The following is a working script that is more elaborate than the one near the top of this page.
ja: 以下は、このページのトップ付近にあるスクリプトよりも、より精巧に作られたワーキングスクリプトです。

source: The following is an alternate way to move the mouse cursor that may work better in certain multi-monitor configurations:
ja: 以下は、特定のマルチモニター構成でより良く機能する可能性のある、マウスカーソルを移動する別の方法です：

source: The following keys are not supported by the built-in remapping method:
ja: 以下のキーは、内蔵リマッピング方式ではサポートされていない：

source: The following limits have been removed by utilizing dynamic allocations:
ja: ダイナミックアロケーションを活用することで、以下の制限を解除しました：

source: The following line can be used to convert Mods to a string of neutral modifiers, such as ^!+#:
ja: 次の行で、Modsを ^!+#のような中立的な修飾語の文字列に変換することができます：

source: The following list contains language names, each of which is associated with a language code (also known as a locale identifier, LCID) that can be contained in the A_Language variable.
ja: 以下のリストには言語名が含まれています。各言語は、A_Language変数に格納できる言語コードと関連付けられています。言語コードはロケール識別子、LCIDとしても知られています。

source: The following list contains the language name that corresponds to each language code that can be contained in the A_Language variable.
ja: 以下のリストには、A_Language変数に格納できる各言語コードに対応する言語名が記載されています。

source: The following may be optionally added to assign an icon to the above:
ja: 上記に対して、アイコンを付与するために、以下を任意に追加することができる：

source: The following may be used as a guide:
ja: 以下は目安としてお使いください：

source: The following modes affect the interpretation of the characters in Keys or the behavior of key-sending functions such as Send, SendInput, SendPlay, SendEvent and ControlSend.
ja: 以下のモードは、Keysの文字の解釈や、Send、SendInput、SendPlay、SendEvent、ControlSendなどのキー送信関数の動作に影響を与えます。

source: The following numbers can be used.
ja: 以下の数字を使用することができます。

source: The following opens This PC (formerly My Computer or Computer).
ja: 次はPC（従来のマイコンピュータまたはコンピュータ）を開きます。

source: The following opens an internet address in the user's default web browser.
ja: 以下は、ユーザーのデフォルトのウェブブラウザでインターネットアドレスを開くものです。

source: The following opens the "My Computer" directory.
ja: 以下は、「マイコンピュータ」ディレクトリを開きます。

source: The following opens the Recycle Bin.
ja: 次はごみ箱を開きます。

source: The following opens the default e-mail application with the recipient filled in.
ja: 以下は、受信者が記入されたデフォルトの電子メールアプリケーションを開くものです。

source: The following opens the recycle bin.
ja: 以下は、ごみ箱を開くものです。

source: The following options are supported:
ja: 以下のオプションに対応しています：

source: The following options can appear inside the YYYYMMDDHH24MISS parameter immediately after the timestamp (if there is no timestamp, they may be used alone).
ja: YYYYMMDDHH24MISSパラメータ内では、タイムスタンプの直後に以下のオプションを表示することができます（タイムスタンプがない場合は、これらのオプションのみを使用することができます）。

source: The following related statements are also grouped with each other, along with their bodies:
ja: また、以下の関連する文は、その本体とともに互いにグループ化されている。

source: The following related statements are also grouped with each other, along with their bodies: If with Else; Loop/For with Until or Else; Try with Catch and/or Else and/or Finally.
ja: また、以下の関連する文は、その本体とともに互いにグループ化されている：IfとElse、Loop/ForとUntilまたはElse、TryとCatchまたは／およびElseまたは／およびFinally。

source: The following script might be useful if you are a heavy user of hotstrings.
ja: ホットストリングのヘビーユーザーであれば、以下のスクリプトが便利かもしれません。

source: The following script uses hotstrings to correct about 4700 common English misspellings on-the-fly.
ja: 以下のスクリプトは、ホットストリングを使用して、一般的な英語のスペルミス約4700個をその場で修正します。

source: The following script was used to create the list above:
ja: 次のスクリプトは上のリストを作ります：

source: The following shows most of the elements of a class definition:
ja: 以下に、クラス定義のほとんどの要素を示す：

source: The following steps are generally used:
ja: 一般的には以下の手順で行われます：

source: The following styles are always enabled and cannot be disabled:
ja: 以下のスタイルは常に有効で、無効にすることはできません：

source: The following subclasses of Error are predefined:
ja: Errorのサブクラスとして、以下のものが予め定義されています：

source: The following table lists the special keys that can be sent (each key name must be enclosed in braces):
ja: 次の表は、送信可能な特殊キーの一覧です（各キー名は、中括弧で囲む必要があります）：

source: The following things support this syntax:
ja: 以下のものがこの構文をサポートしている：

source: The following two examples are equivalent:
ja: 次の2つの例は同等である：

source: The following types of expressions can be used as statements:
ja: ステートメントとして使用できるのは、次の種類の式です：

source: The following types of sub-expressions override precedence/order of evaluation:
ja: 以下のタイプの部分式は、優先順位や評価の順序を上書きする：

source: The following variables are supported:
ja: 以下の変数に対応：

source: The following variables are supported: A_AhkPath, A_AppData, A_AppDataCommon, A_ComputerName, A_ComSpec, A_Desktop, A_DesktopCommon, A_IsCompiled, A_LineFile, A_MyDocuments, A_ProgramFiles, A_Programs, A_ProgramsCommon, A_ScriptDir, A_ScriptFullPath, A_ScriptName, A_Space, A_StartMenu, A_StartMenuCommon, A_Startup, A_StartupCommon, A_Tab, A_Temp, A_UserName, A_WinDir.
ja: 以下の変数に対応：A_AhkPath、A_AppData、A_AppDataCommon、A_ComputerName、A_ComSpec、A_Desktop、A_DesktopCommon、A_IsCompiled、A_LineFile、A_MyDocuments、A_ProgramFiles、A_Programs、A_ProgramsCommon、A_ScriptDir、A_ScriptFullPath、A_ScriptName、A_Space、A_StartMenu、A_StartMenuCommon、A_Startup、A_StartupCommon、A_Tab、A_Temp、A_UserName、A_WinDir。

source: The following variables exist within any file loop.
ja: ファイルループ内には、以下の変数が存在します。

source: The following variables exist within any file-loop.
ja: ファイルループ内には、以下の変数が存在します。

source: The following variables exist within any registry loop.
ja: どのレジストリ-ループ内にも、以下の変数が存在します。
